UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP2823x_v3_3/DSP2823x_serial/src_host/f2833xprg.c
static const OPTION_TABLE OptionTable[] =
{
    { "EmulatorId",             HEX, &Opts.EmulatorId       },
    { "EmuPortAddr",            HEX, &Opts.EmuPortAddr      },
    { "EmuBaudRate",            DEC, &Opts.EmuBaudRate      },
    { "EmuBoardFileName",       STR, &Opts.EmuBoardFileName[0] },
    { "EmuProcessorName",       STR, &Opts.EmuProcessorName[0] },

    { "PrgBootLoadFileName",    STR, &Opts.PrgBootLoadFileName[0] },
    { "PrgSkipBootLoad",        YES, &Opts.PrgSkipBootLoad        },


    { "PrgEraseFileName",       STR, &Opts.PrgEraseFileName[0] },
    { "PrgEraseTimeout",        DEC, &Opts.PrgEraseTimeout  },
    { "PrgEraseOption1",        HEX, &Opts.PrgEraseOption1  },
    { "PrgEraseOption2",        HEX, &Opts.PrgEraseOption2  },
    { "PrgEraseOption3",        HEX, &Opts.PrgEraseOption3  },
    { "PrgEraseOption4",        HEX, &Opts.PrgEraseOption4  },

    { "PrgProgrammingFileName", STR, &Opts.PrgProgrammingFileName[0] },
    { "PrgFlashDataFileName",   STR, &Opts.PrgFlashDataFileName[0] },
    { "PrgProgrammingTimeout",  DEC, &Opts.PrgProgrammingTimeout  },
    { "PrgProgrammingOption1",  HEX, &Opts.PrgProgrammingOption1  },
    { "PrgProgrammingOption2",  HEX, &Opts.PrgProgrammingOption2  },
    { "PrgProgrammingOption3",  HEX, &Opts.PrgProgrammingOption3  },
    { "PrgProgrammingOption4",  HEX, &Opts.PrgProgrammingOption4  },

    { "PrgVerifyFileName",      STR, &Opts.PrgVerifyFileName[0] },
    { "PrgVerifyTimeout",       DEC, &Opts.PrgVerifyTimeout  },
    { "PrgVerifyOption1",       HEX, &Opts.PrgVerifyOption1  },
    { "PrgVerifyOption2",       HEX, &Opts.PrgVerifyOption2  },
    { "PrgVerifyOption3",       HEX, &Opts.PrgVerifyOption3  },
    { "PrgVerifyOption4",       HEX, &Opts.PrgVerifyOption4  },
    // Last entry must be NULL
    { NULL,STR,NULL }
};

// Memory command arguments
static  DWORD  MemAddr;
static  DWORD  MemPage;
static  DWORD  MemBytes;
static  char * pMemData;
static  DWORD  MemCmd;


/*---- function prototypes -------------------------------------------------*/

/*---- macros --------------------------------------------------------------*/

/*****************************************************************************
* PUBLIC FUNCTION DEFINITIONS
*****************************************************************************/

/*****************************************************************************
* PRIVATE FUNCTION DEFINITIONS
*****************************************************************************/

/*F***************************************************************************
* NAME:  void PrgInit()
*
* DESCRIPTION:  Init all the statics
*
* NOTES:
*
*F***************************************************************************/
static void PrgInit()
{
    memset( PrintBuffer,0,sizeof(PrintBuffer));
    ExeStatus = PRG_SUCCESS;
    ThreadTerminate   = FALSE;
    ThreadHandle      = 0;
    dwThreadID        = 0;
    Connected         = 0;
    PrgHandle         = (DWORD)&Opts;
    pfTestPrintMsg    = NULL;
    memset( &Opts, 0, sizeof(F28XXPRG_OPTS) );
    memset( SendBuf,0,sizeof(SendBuf));
    memset( RecvBuf,0,sizeof(RecvBuf));

}
/*F***************************************************************************
* NAME:   void TestPutDiagMsg( const char *Format,...)
*
* DESCRIPTION: Message output function for console applications
*
* NOTES: Output to message channel 1.
*
*F***************************************************************************/
static void
TestPutDiagMsg( const char *Format,...)
{
    va_list  Args;

    if( pfTestPrintMsg != NULL )
    {
        va_start(Args, Format);
        vsprintf(PrintBuffer, Format, Args);
        va_end(Args);

        pfTestPrintMsg( PrgHandle, 1, PrintBuffer );
    }
}

/*F***************************************************************************
* NAME:  int SendBootHeader( unsigned long EntryPoint )
*
* DESCRIPTION: Send the F28xx bootload header
*
* NOTES:
*
*F***************************************************************************/
static int
SendBootHeader( unsigned long EntryPoint )
{

    int  i;
    char ReturnVal;

    char BootHeader[BOOT_HEADER_SIZE+8];
    memset( BootHeader, 0 , sizeof(BootHeader ));

    // The Key
    BootHeader[1-OFFSET]  = (char)0xAA;
    BootHeader[2-OFFSET]  = (char)0x08;
    // The Entry point
    BootHeader[19-OFFSET] = (char)((EntryPoint>>16) & 0x00ff );
    BootHeader[20-OFFSET] = (char)((EntryPoint>>24) & 0x00ff );
    BootHeader[21-OFFSET] = (char)((EntryPoint    ) & 0x00ff );
    BootHeader[22-OFFSET] = (char)((EntryPoint>> 8) & 0x00ff );

    for(i=0; i<BOOT_HEADER_SIZE; i++ )
    {
        if( SioSendMsg( &BootHeader[i], 1 ) == 1 )
        {
#if defined( DO_READBACK_VERIFY )
            SioRecvMsg( &ReturnVal, 1 );
             if( (BootHeader[i] &0x00FF)  != ( ReturnVal & 0x00FF ))
                 return(PRG_FAIL);
#endif
        }
        else
            return(PRG_FAIL);
    }

    return(0);

}
/*F***************************************************************************
* NAME:  int  SendSectionHeader( unsigned long SectionAddr, int NumWords )
*
* DESCRIPTION: Send a F28xx section header
*
* NOTES:
*
*F***************************************************************************/
static int
SendSectionHeader( unsigned long SectionAddr, int NumWords )
{

    int  i;
    char ReturnVal;

    char SectionHeader[SECTION_HEADER_SIZE+8];
    memset( SectionHeader, 0 , sizeof(SectionHeader ));

    // Section size words
    SectionHeader[1-OFFSET] = (char)((NumWords     ) & 0x00ff );
    SectionHeader[2-OFFSET] = (char)((NumWords >> 8) & 0x00ff );
    // Section start address
    SectionHeader[3-OFFSET] = (char)((SectionAddr>>16) & 0x00ff );
    SectionHeader[4-OFFSET] = (char)((SectionAddr>>24) & 0x00ff );
    SectionHeader[5-OFFSET] = (char)((SectionAddr    ) & 0x00ff );
    SectionHeader[6-OFFSET] = (char)((SectionAddr>> 8) & 0x00ff );

    for(i=0; i<SECTION_HEADER_SIZE; i++ )
    {
        if( SioSendMsg( &SectionHeader[i], 1 ) == 1 )
        {
#if defined( DO_READBACK_VERIFY )
            SioRecvMsg( &ReturnVal, 1 );
             if( (SectionHeader[i] &0x00FF)  != ( ReturnVal & 0x00FF ))
                 return(PRG_FAIL);
#endif
        }
        else
            return(PRG_FAIL);
    }

    return(0);
}
/*F***************************************************************************
* NAME:  int  SendSectionData( int NumWords, char *pData )
*
* DESCRIPTION: Send the F28xx section data
*
* NOTES:
*
*F***************************************************************************/
static int
SendSectionData( int NumWords, char *pData )
{
    int  i;
    char ReturnVal;

    int NumToSend = NumWords*2;

    for(i=0; i<NumToSend; i++ )
    {
        if( SioSendMsg( pData, 1 ) == 1 )
        {
#if defined( DO_READBACK_VERIFY )
             SioRecvMsg( &ReturnVal, 1 );
             if( (*pData &0x00FF)  != ( ReturnVal & 0x00FF ))
                 return(PRG_FAIL);
#endif
             pData++;
        }
        else
            return(PRG_FAIL);
    }
    return( 0 );
}

/*F***************************************************************************
* NAME: int LoadBootCoffImage( char * pCoffName )
*
* DESCRIPTION: Loads the F28xx flash algo file via the F28xx bootloader.
*
* NOTES: Assumes the F28xx is in serial bootload mode and executing the
*        bootloader.
*
*F***************************************************************************/
static int
LoadBootCoffImage( char * pCoffName )
{
    COFF_OPTS         CoffOptions;
    COFF_HNDL         pCoffHndl    = NULL;
    char             *pCoffData    = NULL;

    int               CoffStatus;
    int               NumSections,i;
    long              ActualBytesRead, NumToRead;
    TI_SCNHDR       * pSectionHdr;
    long              CoffBufferSize;
    int               Success = 0;


    if(( pCoffName == NULL ) || (*pCoffName == '\0' ))
        return( PRG_FAIL);

    ZeroMemory( &CoffOptions, sizeof(COFF_OPTS));

    CoffStatus = COFFR_FileOpen( pCoffName, &CoffOptions, &pCoffHndl );
    if( CoffStatus != 0 )
        return( PRG_FAIL);

    CoffBufferSize = LOCTOBYTE( pCoffHndl, pCoffHndl->FileInfo->largest_sect_size);

