UBCFormulaElectric/BAMOCAR-D3/NDrive2 Software/Firmware update 2015/CCStudio_v3.3/specdig/sdflash/mydrivers/DSP2823x_v3_3/DSP2823x_serial/src_host/f2833xprg.c
EXPORT int
PRG_FlashRead( DWORD Handle, DWORD Addr, DWORD Page, DWORD NumBytes, char *pData )
{
    if( ExeStatus != PRG_BUSY )
    {
        ExeStatus       = PRG_BUSY;
        ThreadTerminate = FALSE;

        MemAddr  = Addr;
        MemPage  = Page;
        MemBytes = NumBytes;
        pMemData = pData;
        MemCmd   = CMD_FLASH_READ;

#if defined( USE_THREADS )

        ThreadHandle = _beginthreadex( (LPSECURITY_ATTRIBUTES)NULL,
	                                    (DWORD)0,
	                                    (LPTHREAD_START_ROUTINE)MemRead,
                                        (LPVOID)Handle,
                                        (DWORD)0,
	                                    (LPDWORD)&dwThreadID );
        Sleep(0);

        if( ThreadHandle == 0 )
            ExeStatus = PRG_FAIL;
#else
        // ExeStatus is set by MemRead
        MemRead( Handle );
#endif
    }
    return( ExeStatus );
}

EXPORT int
PRG_MemRead( DWORD Handle, DWORD Addr, DWORD Page, DWORD NumBytes, char *pData )
{
    if( ExeStatus != PRG_BUSY )
    {
        ExeStatus       = PRG_BUSY;
        ThreadTerminate = FALSE;

        MemAddr  = Addr;
        MemPage  = Page;
        MemBytes = NumBytes;
        pMemData = pData;
        MemCmd   = CMD_MEM_READ;

#if defined( USE_THREADS )

        ThreadHandle = _beginthreadex( (LPSECURITY_ATTRIBUTES)NULL,
	                                    (DWORD)0,
	                                    (LPTHREAD_START_ROUTINE)MemRead,
                                        (LPVOID)Handle,
                                        (DWORD)0,
	                                    (LPDWORD)&dwThreadID );
        Sleep(0);

        if( ThreadHandle == 0 )
            ExeStatus = PRG_FAIL;
#else
        // ExeStatus is set by MemRead
        MemRead( Handle );
#endif
    }
    return( ExeStatus );
}

/*F***************************************************************************
* NAME: int  PRG_FlashVerify( DWORD Handle, DWORD Addr, DWORD Page,
*                             DWORD NumBytes, char *pData )
*
* DESCRIPTION:  Verify a block of flash.
*
* NOTES:  This function is F28xx specific.  We are doing verify with a simple
*         checksum.  This is much faster then passing all the data back to
*         target for a word by word verify.  The target algo can do the
*         word by word verify as part of programming and use this verify
*         as a simple sanity check with all flash is programmed.
*
*F***************************************************************************/
EXPORT int
PRG_FlashVerify( DWORD Handle, DWORD Addr, DWORD Page, DWORD NumBytes, char *pData )
{
    int     Error    = 0;
    char    *pSbuf;
    char    *pRbuf;
    int     CmdErr;

    unsigned short *p16 = (unsigned short *)pData;

    DWORD   i;
    DWORD   NumXfer;
    DWORD   NumBytesSend = 0;
    DWORD   CheckSum     = 0;
    DWORD   NumToCheck   = NumBytes/2;
    DWORD   SleepTime;

    int     Success = PRG_FAIL;

    if( ( Connected == 0 ) || ( ExeStatus == PRG_BUSY ))
        goto EXIT_FlashVerify;

    // Set to fail to catch all errors
    ExeStatus = PRG_FAIL;

    CheckSum = 0;
    for(i=0; i<NumToCheck; i++ )
        CheckSum += *p16++;

    SleepTime = VERIFY_TIMEOUT(NumBytes);


    pSbuf = SendBuf;
    Put16(pSbuf,CMD_FLASH_VERIFY );// Cmd
    Put32(pSbuf,Addr);         // Addr
    Put16(pSbuf,Page);         // Page
    Put16(pSbuf,NumToCheck);   // Length
    Put16(pSbuf,Opts.PrgVerifyOption1);  // PRG_option1
    Put16(pSbuf,Opts.PrgVerifyOption2);  // PRG_option2
    Put16(pSbuf,Opts.PrgVerifyOption3);  // PRG_option3
    Put16(pSbuf,CheckSum);               // PRG_option4
    Put16(pSbuf,-1 );          // Status

    NumXfer = PktSendMsg( SendBuf,SIZE_COMMAND_BLOCK  );
    if( NumXfer == 0 )
    {
        TestPutDiagMsg("Send packet rejected\n");
        goto EXIT_FlashVerify;
    }

    Sleep( SleepTime );

    // Wait for return status.  Should get back 1 status word
    NumXfer = PktRecvMsg( RecvBuf, MSG_BODY_SIZE );
    if( NumXfer >= 2 )
    {
        pRbuf = RecvBuf;
        Get16(pRbuf,CmdErr);
    }
    else
        CmdErr = -1;

    if( CmdErr != 0 )
    {
        TestPutDiagMsg("Verify Failed, Address = %08lx\n", Addr);
        goto EXIT_FlashVerify;
    }
    // No errors so set success
    Success = PRG_SUCCESS;

EXIT_FlashVerify:
    ExeStatus = Success;
    return( Success );
}

/*F***************************************************************************
* NAME: int  PRG_Status( DWORD Handle )
*
* DESCRIPTION:  Check the status of current executing command
*
* NOTES:  This function supports both thread and non-thread operation.  In
*         thread mode the function will wait for the thread to complete
*         once it sees the thread is not in the PRG_BUSY state.  When
*         status is PRG_BUSY user should only call two functions:
*            1) PRG_Status
*            2) PRG_Close.  This will request all threads to terminate.
*
*F***************************************************************************/

EXPORT int
PRG_Status( DWORD Handle )
{

#if defined( USE_THREADS )
    DWORD ThreadState;

    // If we are NOT busy and the thread is active then wait for
    // thread to stop.  All threads set the status to !busy on exit.
    // This ensures that the current thread completes before we start
    // another thread.
    //
    if( ( ExeStatus != PRG_BUSY ) && ( ThreadHandle != 0 ) )
    {
        ThreadState = WaitForSingleObject( (HANDLE)ThreadHandle, 10 );
        if( ThreadState == WAIT_OBJECT_0 )
            ThreadHandle = 0;
    }
#endif

    return( ExeStatus );
}

const SD_PRG_INTERFACE SdPrgInterface =
{
    sizeof(SD_PRG_INTERFACE),
    PRG_VERSION,
    PRG_REVISION,
    PRG_INTERFACE_TYPE_RS232,
    1,
    PRG_INTERFACE_NAME,
    PRG_FLAG_NONE,
    PRG_C28XX_BITS_PER_ADDR_UNIT,
    PRG_Init,
    PRG_SetOptions,
    PRG_Status,
    PRG_Open,
    PRG_Close,
    PRG_SetMessageCallBack,
    PRG_FlashErase,
    PRG_FlashWrite,
    PRG_FlashRead,
    PRG_FlashVerify,
    PRG_MemWrite,
    PRG_MemRead
};

/*F***************************************************************************
* NAME: int  PRG_GetInterface( const SD_PRG_INTERFACE  **pIntf)
*
* DESCRIPTION:  Returns a pointer to interface structure. Simplifies dynamic
*               loading of DLL and resolving function pointers.
*
* NOTES:
*
*F***************************************************************************/

EXPORT int
PRG_GetInterface( const SD_PRG_INTERFACE  **pIntf)
{

    if( pIntf != NULL )
    {
        *pIntf = &SdPrgInterface;
        return( PRG_SUCCESS );
    }
    else
        return( PRG_FAIL );
}

